[{"title": "MIT Reality Hack 2023", "description": "<p>Team submission to a 3-day VR/AR hackathon at MIT as a part of the hardware track. We designed our own controller connecting to a Oculus headset via bluetooth. We wanted to make climbing the stairs more fun by incorporating hardware feedback (LEDs and vibration motors activated by a step count) and motivating videos embedded into the VR passthrough experience. I designed the step tracking system based on IMU sensor and barometer, plus firmware integration. This project won the \"Hardware: Interfacing with the Human Body\" track. \n<a href=\"https://devpost.com/software/arcade-steps\" target=\"_blank\">(Link to a Devpost for more details)</a>\n</p>", "tags": ["featured", "hardware", "VR/AR", "firmware", "C/C++", "ESP32", "hackathon projects", "all projects"], "img": "../imgs/arcade-steps.png"}, {"title": "Eye-tracking system", "description": "<p>A full-stack neurotechnology project involving both hardware and firmware development components. The eye-tracking system is based on <a href=\"https://en.wikipedia.org/wiki/Electrooculography\" target=\"_blank\">electrooculography (EOG)</a> technique (not cameras, as compared to the standard in AR/VR applications), and allows basic control of a <a href=\"https://trex-runner.com/\" target=\"_blank\">Chrome dinosaur game</a> with blinks. On the GIF, electrodes are attached to the area above and below my eye that measures voltage difference between the two sites. That signal is later filtered and amplifier through an analog front-end PCB that later connects to a laptop for visualization.\n<a href=\"https://github.com/neurotech-berkeley-devices/eog-eye-tracking\" target=\"_blank\">Github</a>\n</p>", "tags": ["featured", "neurotech", "hardware", "software", "firmware", "Python", "C/C++", "ongoing projects", "all projects"], "img": "../imgs/dino-game.gif"}, {"title": "EOG analog front end PCB (2nd gen)", "description": "<p>Second iteration of the EOG PCB. This board was designed to accommodate for varying strength of the EOG signal in each person, and it features multiple digital potentiometers instead of fixed resistors at amplification stages. Inputs and outputs of the PCB are similar to the 1st gen board, and it is smaller and more compatible with a consumer headset.\n</p>", "tags": ["neurotech", "hardware", "all projects"], "img": "../imgs/eog_2nd_gen.jpg"}, {"title": "Delivery robot", "description": "<p>A remote-controlled robot with object-grasping capabilities built during a week-long hackathon. The goal of the competition was to build a free-form robot fitting certain size parameters to score as many points as possible by grabbing/transporting objects to a certain area, building a tower, completing side challenges, etc. I developed all the firmware for both the robot and the remote control required to drive the robot and control the claw.\n</p>", "tags": ["featured", "firmware", "C/C++", "Arduino", "all projects"], "img": "../imgs/robot1.gif"}, {"title": "EOG analog front end PCB (1st gen)", "description": "<p>A 4-layer printed circuit board dedicated to collecting EOG signals for eye tracking. The PCB features two identical channels (for capturing vertical and horizontal eye movements). Each channel has an instrumentation amplifier, a high pass filter (0.4Hz cutoff), a twin-T notch filter for eliminating the 60Hz noise, Sallen-Key low pass filter (48Hz cutoff), and another amplification stage. All circuit blocks are intended to capture the EOG signal, so every setting was selected to accomodate for the frequency range and the typical amplitude of the signal. The input to the board are power + five electrodes (2 per channel, and one reference). The output are two analog signals that could be sampled with a 5V-compatible microcontroller.\n</p>", "tags": ["neurotech", "hardware", "all projects"], "img": "../imgs/eog_1st_gen.jpg"}, {"title": "SIXT33N on Mars", "description": "<p>SP21 TI Design contest submission. Apart from building a basic voice-controlled car (standard semester-long project in EECS16B), I expanded its features to include a camera sitting on a servo motor that is controlled through a web server runnning on a Raspberry Pi. Inspired by a recent Mars rover landing back then, I designed a theme for my project according to it. The web server acted as a mission control center that displayed a real-time camera stream, temperature data, and allowed the remote control of the camera. \nThis hack was built less than 24 hours before the submission deadline :P \nI got a 1st place. Here is the <a href=\"https://sixt33ntomars.web.app/\" target=\"_blank\">web app and demo</a>.\n</p>", "tags": ["class projects", "firmware", "software", "Python", "Raspberry Pi", "all projects"], "img": "../imgs/sixteen.jpg"}, {"title": "Robot tracker", "description": "<p>A concept of a robotics olympiad that I designed as a part of advanced robotics division in MSHP (Moscow School of Programmers) while in high school. The olympiad itself are for kids making Lego robots that need to follow the course map and receive the commands by accessing a web server telling them whether it's safe to move forward (this is where my Qt application comes in). The image below is a proof-of-concept of the command panel that I designed to be used by the operators. A simple web camera is secured directly above the map. I performed a real-time video processing with OpenCV (C++) that detected robots (pure computer vision based on HSV thresholding) and determined whether any of them are on a collision course.\n</p>", "tags": ["personal projects", "software", "C/C++", "computer vision", "all projects"], "img": "../imgs/robotics-olympiad.png"}, {"title": "Build your own world (BYOW)", "description": "<p>An open-ended game development project as a part of <a href=\"https://sp21.datastructur.es/materials/proj/proj3/proj3\" target=\"_blank\">CS61B (Data Structures)</a> course. This project is in the theme of then-popular Among Us game. It allows you to select from a range of avatars and navigate a randomly-generated world. I used an A* and Kruskal's MST algorithm to generate valid hallways and rooms. As an additional features, there are vents that teleport an avatar to a random location within the world and an option where the light source is only turned on in the square around the avatar.\n(Learn more)\n</p>", "tags": ["class projects", "software", "Java", "all projects"], "img": "../imgs/byow.png"}, {"title": "ingarobotics.com", "description": "<p>This website was build from scratch by me using React. This is the third time I am redesigning my personal website - I tried HTML templates and <a href=\"https://gohugo.io/\" target=\"_blank\">Hugo</a> in the past, but I didn't like being constrained by the styles and format that these methods have provided me. Plus, I wanted to do some coding during the winter break and learn React at last.\n</p>", "tags": ["personal projects", "ongoing projects", "software", "React", "all projects"], "img": "../imgs/website.png"}, {"title": "CanSat 2016", "description": "<p>A year-long team project as a part of the <a href=\"https://cansatcompetition.com/\" target=\"_blank\">CanSat competition</a> building an atmospheric probe. By the competition requirements, we successfully launched a probe to the height of over a mile, transmitted and received telemetry (pressure, temperature sensor data), and deployed the parachute. As an additional challenge, we added a CO2 and O2 sensors and a mechanism for spreading mustard seeds upon landing (in the form of a 3D-printed compartment activated by a spring). I designed and etched all the custom PCBs from scratch on board and was responsible for the electronics in general.\n</p>", "tags": ["hardware", "team projects", "all projects"], "img": "../imgs/cansat2016.jpg"}, {"title": "CanSat 2017", "description": "<p>A year-long team project as a part of the <a href=\"https://cansatcompetition.com/\" target=\"_blank\">CanSat competition</a> building an atmospheric probe. By the competition requirements, we successfully launched a probe to the height of over a mile, transmitted and received telemetry (pressure, temperature, IMU sensor data), and deployed the parachute. I designed a soil-resistance measuring module from scratch and designed an algorithm for measuring the resistance with digital potentiometer/multiplexer and wrote a firmware (in C) for it on the main controller. I also built the electronics behind the parachute deployment system and the firmware for luminosity sensors that track the probe's position in relation to the light source. We placed 1st nationally among 70 other teams in the division. \n</p>", "tags": ["hardware", "firmware", "C/C++", "team projects", "all projects"], "img": "../imgs/cansat2017.jpg"}, {"title": "CanSat 2018", "description": "<p>A year-long team project as a part of the <a href=\"https://cansatcompetition.com/\" target=\"_blank\">CanSat competition</a> building an atmospheric probe. 1-kg full of awesome hardware. By the competition requirements, we successfully launched a probe to the height of over a mile, transmitted and received telemetry (pressure, temperature, IMU sensor data), and deployed the parachute. \nI built the firmware and electronics behind the custom spectrometer module to interact with a servo motor and a camera using Raspberry Pi. I also built the electronics behind the parachute deployment system. We placed 2nd nationally among other teams in the heavy-weight division. \n</p>", "tags": ["hardware", "firmware", "team projects", "Python", "Raspberry Pi", "all projects"], "img": "../imgs/cansat2018.jpg"}, {"title": "NFC contact card:", "description": "<p>A custom-made contact PCB card that redirects to my LinkedIn page when tapping on a phone. The card has an NFC chip and an LED that lights up upon contact.\n(See demo)\n</p>", "tags": ["personal projects", "hardware", "all projects"], "img": "../imgs/contact-card.jpg"}, {"title": "Cal Hacks 8.0 badge", "description": "<p>An interactive conference PCB badge designed specifically for <a href=\"https://www.calhacks.io/\" target=\"_blank\">Cal Hacks hackathon</a>. This is a large-scale project (order of ~500 boards) where the bare boards were distributed at a soldering workshop and assembled by the Cal Hacks participants. I designed the PCBs and organized a full-day soldering workshop attended by hundreds hackers.\n(Learn more)\n</p>", "tags": ["hardware", "personal projects", "firmware", "C/C++", "all projects"], "img": "../imgs/badge.gif"}, {"title": "CopterHack", "description": "<p>Autonomous drone assembled and programmed in a weekend during a <a href=\"https://coex.tech/copterhack2022\" target=\"_blank\">CopterHack</a> hackathon.\n</p>", "tags": ["hackathon projects", "computer vision", "Python", "Raspberry Pi", "all projects"], "img": "../imgs/copter.jpg"}, {"title": "Raspberry Pi hat", "description": "<p>An add-on module for Raspberry Pi to support a system for autonomous testing of multiple boards.\n</p>", "tags": ["hardware", "Raspberry Pi", "Python", "all projects"], "img": "../imgs/hat.jpg"}, {"title": "Line-following robot", "description": "<p>Line-following robot equipped with optical and sonic sensors capable of obstacle avoidance.\n</p>", "tags": ["hackathon projects", "firmware", "Arduino", "C/C++", "all projects"], "img": "../imgs/robot2.jpg"}, {"title": "Remote Control", "description": "<p>A radio-equipped remote control for a robot with a custom-designed PCB. My first experience using professional PCB fabrication and laser cutting services. A piece of art.\n</p>", "tags": ["personal projects", "hardware", "Arduino", "C/C++", "all projects"], "img": "../imgs/remote.jpg"}, {"title": "Wall-climbing robot", "description": "<p>Final project for an engineering design course I took my senior year of high school. The carcass was designed by me, and it was my first experient 3D modeling and printing.\n</p>", "tags": ["class projects", "hardware", "3D modeling", "Arduino", "C/C++", "all projects"], "img": "../imgs/wall-climber.jpg"}]